app/controllers/friends_controller.rb

  def show
    @friends = Friend.find(params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @friend = Friend.new(params[:friends])

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-11-16 12:53:51.821219"], ["updated_at", "2021-11-16 12:53:51.821219"]]

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "first_name" = ?, "last_name" = ?, "email" = ?, "phone" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["first_name", ""], ["last_name", ""], ["email", ""], ["phone", ""], ["twitter", ""], ["updated_at", "2021-11-16 12:54:52.117428"], ["id", 24]]